Revit 2024 API
BuiltInFailures.GenericMEPFailures.FlowDirectionMismatch Property
 [Element Name]: It is not possible to calculate the flow since the flow direction mismatch. Please check flow direction on all equipment in this system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FlowDirectionMismatch { get; }
Visual Basic
Public Shared ReadOnly Property FlowDirectionMismatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FlowDirectionMismatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace